zachleedogg/E_Moto/Firmware/Projects/ezbl-v2.04/ex_boot_app_blink_dual_partition/hardware_initializers/dspic33ep64gs502_digital_power_starter_kit.c
/*
 * File:   dspic33ep64gs502_digital_power_starter_kit.c
 *
 * Initializes the device configuration fuses, clock frequency, UART2 pins,
 * for the dsPIC33EP64GS502 soldered on the Microchip Digital Power Starter Kit.
 *
 * Digital Power Starter Kit (DM330017-2) User's Guide, including schematic:
 * http://ww1.microchip.com/downloads/en/DeviceDoc/50002330b.pdf
 *
 * dsPIC33EP64GS502 product page:
 * http://www.microchip.com/wwwproducts/en/dsPIC33EP64GS502
 *
 * To get UART access from a PC onto this board, connect an MCP2221A Breakout 
 * Module (ADM00559) to the J1 header on the left side of the PCB.  MCP2221A 
 * breakout module J3 pin 1 (TX) should connect to the top-most pin of J1 (pin 
 * closest to the LCD). Ensure the module power jumper is set for 3.3V.
 * 
 * An MCP2200 Breakout Module (ADM00393) can be used instead of the MCP2221A, 
 * but J1 pins 4 and 5 need to be bent away or otherwise left disconnected from 
 * the breakout module as they are I2C SDA and SCL lines on the Digital Power 
 * Starter Kit, but RTS/CTS signals on the breakout module.
 */

// DOM-IGNORE-BEGIN
/*******************************************************************************
  Copyright (C) 2017 Microchip Technology Inc.

  MICROCHIP SOFTWARE NOTICE AND DISCLAIMER:  You may use this software, and any
  derivatives created by any person or entity by or on your behalf, exclusively
  with Microchip's products.  Microchip and its licensors retain all ownership
  and intellectual property rights in the accompanying software and in all
  derivatives here to.

  This software and any accompanying information is for suggestion only.  It
  does not modify Microchip's standard warranty for its products.  You agree
  that you are solely responsible for testing the software and determining its
  suitability.  Microchip has no obligation to modify, test, certify, or
  support the software.

  THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS".  NO WARRANTIES, WHETHER
  EXPRESS, IMPLIED OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED
  WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND FITNESS FOR A PARTICULAR
  PURPOSE APPLY TO THIS SOFTWARE, ITS INTERACTION WITH MICROCHIP'S PRODUCTS,
  COMBINATION WITH ANY OTHER PRODUCTS, OR USE IN ANY APPLICATION.

  IN NO EVENT, WILL MICROCHIP BE LIABLE, WHETHER IN CONTRACT, WARRANTY, TORT
  (INCLUDING NEGLIGENCE OR BREACH OF STATUTORY DUTY), STRICT LIABILITY,
  INDEMNITY, CONTRIBUTION, OR OTHERWISE, FOR ANY INDIRECT, SPECIAL, PUNITIVE,
  EXEMPLARY, INCIDENTAL OR CONSEQUENTIAL LOSS, DAMAGE, FOR COST OR EXPENSE OF
  ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWSOEVER CAUSED, EVEN IF
  MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE.
  TO THE FULLEST EXTENT ALLOWABLE BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL
  CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT EXCEED THE AMOUNT OF
  FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.

  MICROCHIP PROVIDES THIS SOFTWARE CONDITIONALLY UPON YOUR ACCEPTANCE OF THESE
  TERMS.
*******************************************************************************/
// DOM-IGNORE-END

#if defined(__dsPIC33EP64GS506__) || defined(__dsPIC33EP64GS504__)  || defined(__dsPIC33EP64GS502__) ||     \
    defined(__dsPIC33EP32GS506__) || defined(__dsPIC33EP32GS504__)  || defined(__dsPIC33EP32GS502__) ||     \
    defined(__dsPIC33EP16GS506__) || defined(__dsPIC33EP16GS504__)  || defined(__dsPIC33EP16GS502__)

#define FCY                 70000000ul

#include <xc.h>
#include <libpic30.h>   // For __delay32()
#include <stdarg.h>     // For va_args used by LCD_printf()
#include "../ezbl_integration/ezbl.h"


// Device Configuration Words
// Config words can be defined in a Bootloader project, Application project,
// or mixed between each other so long as any given flash/config write-word-
// size location has exectly one definition. On devices with flash Config
// words and a flash double word minimum programming size (0x4 program
// addresses), this means two adjacent Config words may not be mixed between
// projects and instead both Config words must be defined in the same project.
//
// These defaults place all (or almost all) in the Bootloader project as this
// is the safest from a bootloader-bricking standpoint.
#if defined(EZBL_BOOT_PROJECT)  // Compiling for a Bootloader Project
    EZBL_SET_CONF(_FSEC, BWRP_OFF & BSS_DISABLED & BSEN_OFF & GWRP_OFF & GSS_DISABLED & CWRP_OFF & CSS_DISABLED & AIVTDIS_OFF)
    EZBL_SET_CONF(_FOSCSEL, FNOSC_FRC & IESO_OFF)
    EZBL_SET_CONF(_FOSC, POSCMD_NONE & OSCIOFNC_ON & IOL1WAY_OFF & FCKSM_CSECME & PLLKEN_ON)        // No primary oscillator, recover OSC2 pin as GPIO, allow multiple PPS remappings, enable clock switching and fail safe clock monitor, wait for PLL to lock
    EZBL_SET_CONF(_FWDT, WDTPOST_PS256 & WDTPRE_PR32 & WDTEN_ON_SWDTEN & WINDIS_OFF & WDTWIN_WIN75) // ~256ms timeout when watchdog is turned on in software (not forced on in hardware), use ordinary (non-windowed) Watchdog Timer mode
    EZBL_SET_CONF(_FICD, ICS_PGD2 & JTAGEN_OFF & BTSWP_ON)
    EZBL_SET_CONF(_FDEVOPT, PWMLOCK_OFF & ALTI2C1_OFF & ALTI2C2_OFF & DBCC_OFF)
    #if defined(__DUAL_PARTITION)
    EZBL_SET_CONF(_FBOOT, BTMODE_DUAL)  // Default is BTMODE_SINGLE, BTMODE_DUAL is for ping-ponging, BTMODE_DUALPROT is for statically write-protecting Partition 1, BTMODE_DUALPRIV is reserved/do not use
    #endif
#else   // Compiling for an Application Project (EZBL_BOOT_PROJECT is not defined)
    //EZBL_SET_CONF_FBTSEQ(4096)        // Use this is if you need to explicitly set the FBTSEQ value in code. Generally, you should NOT have this defined as it will be computed at run-time based on the programming order and predefined values will force an erase-modify-write of the whole Flash page contents.
    EZBL_SET_CONF(_FALTREG, CTXT1_IPL7 & CTXT2_IPL6)                                                // DO NOT assign a register set to IPL4 used by the NOW timer/NOW_TaskDispatcher() without changing the NOW IPL to something different.
#endif  // Goes to: #if defined(EZBL_BOOT_PROJECT)



