zachleedogg/E_Moto/Firmware/Projects/ezbl-v2.04/ex_boot_app_blink_dual_partition/hardware_initializers/dspic33ep64gs502_digital_power_starter_kit.c
// Set flash page erase size = 0x400 program addresses = 1536 Flash bytes/512 instruction words/256 Flash double words.
// PIC24FJ1024GB610/GA610 family devices implement 0x800; dsPIC33EP64GS506, dsPIC33EP128GS808, PIC24FJ256GB412/GA412 family devices implement 0x400.
// Single Partition bootloaders don't have to define this as it is automatically obtained by ezbl_tools.jar and inserted in the .gld linker script.
EZBL_SetSYM(EZBL_ADDRESSES_PER_SECTOR, 0x400);



//const unsigned int EZBL_i2cSlaveAddr = 0x60;          // Define I2C Slave Address that this Bootloader will listen/respond to, applicable only if I2C_Reset() is called
EZBL_FIFO *EZBL_COMBootIF __attribute__((persistent));  // Pointer to RX FIFO to check activity on for bootloading
const long EZBL_COMBaud = -230400;                      // Communications baud rate: <= 0 means auto-baud with default value (for TX) set by the 2's complemented value; otherwise baud in bits/sec (ex: 460800)



#define LCD_RST         _LATB15     // 15, PGEC3/SCL2/RP47/RB15
#define LCD_RST_TRIS    _TRISB15
#define LCD_CS          _LATB11     // 21, TMS/PWM3H/RP43/RB11
#define LCD_CS_TRIS     _TRISB11
#define LCD_RS          _LATB5      // 16, TDO/AN19/PGA2N2/RP37/RB5
#define LCD_RS_TRIS     _TRISB5
#define LCD_SCK         _LATB10     // 7, AN5/CMP2D/CMP3B/ISRC3/RP42/RB10
#define LCD_SCK_TRIS    _TRISB10
#define LCD_MOSI        _LATB1      // 9, OSC1/CLKI/AN6/CMP3C/CMP4A/ISRC2/RP33/RB1
#define LCD_MOSI_TRIS   _TRISB1


static const unsigned int line_address[] = {0x00, 0x40, 0x20, 0x60};  // Line 1 addresses are 0x00-0x1F, Line 2 addresses are 0x40-0x6F, Line 3 (if present) addresses are 0x20-0x3F, Line 4(if present) addresses are 0x60-0x7F
static const unsigned int xLimit = 16;                                // 16 characters per line on this LCD
static const unsigned int yLimit = 2;                                 // 2 line LCD

static unsigned long lastLCDUpdate  __attribute__((persistent));
static unsigned long busyInterval   __attribute__((persistent));    // NOW counter value indicating when the last command is finished
static int lastX, lastY             __attribute__((persistent));
static unsigned int emulatedLEDs    __attribute__((persistent));    // State holder for LEDs emulated on character LCD screen

void LCD_Init(void);
void LCD_Clear(void);
void LCD_Goto(int x, int y);
void LCD_Put8(int data_instr, char c);
void LCD_Put(int x, int y, const char *data, unsigned int dataLen);
void LCD_PutStr(int x, int y, const char *s);
void LCD_printf(int x, int y, const char *format, ...);



// @return: FCY clock speed we just configured the processor for
unsigned long InitializeBoard(void)
{
    // Switch to FRC clock (no PLL), in case if the PLL is currently in use.
    // We are not allowed to change the PLL prescalar, postscalar or feedback
    // divider while it is running.
    __builtin_write_OSCCONH(0x00);
    __builtin_write_OSCCONL(OSCCON | _OSCCON_OSWEN_MASK);
    while(OSCCONbits.OSWEN);            // Wait for clock switch to complete

    // Configure PLL for Fosc = 140MHz/Fcy = 70MIPS using 7.37 MHz internal FRC oscillator
    CLKDIV = 0xB000; // ROI = 1, DOZE = 8:1, FRCDIV = 1:1, PLLPOST = 2:1, PLLPRE = 2:1
    PLLFBD = (FCY * 2u * 2u * 2u + 7370000u / 2u) / 7370000u - 2u; // 74 @ 70 MIPS (7.37 MHz input clock from FRC)
    __builtin_write_OSCCONH(0x01);      // Initiate Clock Switch to use the FRC Oscillator + PLL (NOSC = 0b001)
    __builtin_write_OSCCONL(OSCCON | _OSCCON_OSWEN_MASK);

    // Wait for clock switch to complete and PLL to be locked (if enabled)
    while(OSCCONbits.OSWEN);            // Wait for clock switch to complete
    if((OSCCONbits.COSC & 0x5) == 0x1)  // 0x0 = Fast RC Oscillator (FRC); 0x1 = Fast RC Oscillator (FRC) with Divide-by-N and PLL; 0x2 = Primary Oscillator (XT, HS, EC); 0x3 = Primary Oscillator (XT, HS, EC) with PLL; 0x4 = Secondary Oscillator (SOSC); 0x5 = Low-Power RC Oscillator (LPRC); 0x6 = Fast RC Oscillator (FRC) with Divide-by-16; 0x7 = Fast RC Oscillator (FRC) with Divide-by-N
    {
        while(!_LOCK);
    }


    // Initialize/select 16-bit hardware timer for NOW time keeping/scheduling
    // APIs. This call selects the hardware timer resource (can be TMR1-TMR6 or
    // CCP1-CCP8, if available) and the _Tx/_CCTxInterrupt gets automatically
    // implemented by code in ezbl_lib.a.
    NOW_Reset(TMR1, FCY);

    
    // Set push button as GPIO input
    //
    // Function     dsPIC33EP64GS502 Device Pins
    // Button       PIC#, name
    // SW1          14, PGED3/RP8/CN8/RB8
    EZBL_DefineButtonMap(RB8);
    _TRISB8 = 1;


#if defined(XPRJ_i2c) || defined(XPRJ_default) || defined(EZBL_INIT_I2C)    // XPRJ_* definitions defined by MPLAB X on command line based on Build Configuration. If you need this interface always, you can alternatively define a project level EZBL_INIT_I2C macro.
    // Configure I2C 1 pins
    //
    // SDA1 = PGEC1/AN21/SDA1/RP39/RB7
    // SCL1 = PGED1/TDI/AN20/SCL1/RP38/RB6
    _CNPUB7 = 1;    // Enable weak pull up on SDA1 line
    _CNPUB6 = 1;    // Enable weak pull up on SCL1 line
    _ANSB6  = 0;    // 0 = Digital I/O; 1 = Analog I/O
    _ANSB7  = 0;    // 0 = Digital I/O; 1 = Analog I/O
    EZBL_COMBootIF = I2C_Reset(1, FCY, 0, EZBL_i2cSlaveAddr, 0);
#endif


#if defined(XPRJ_uart) || defined(XPRJ_default) || defined(EZBL_INIT_UART)    // XPRJ_* definitions defined by MPLAB X on command line based on Build Configuration. If you need this interface always, you can alternatively define a project level EZBL_INIT_UART macro.
    // Configure GPIO1 and GPIO2 as UART2 pins.
    // - Pin names are with respect to the PIC.
    //
    // Function     dsPIC33EP64GS502 Device Pins
    // UART2        PIC#, name
    // U2TX  (out)  23, GPIO2 - PWM2H/RP45/RB13
    // U2RX  (in)   22, GPIO1 - TCK/PWM3L/RP44/RB12
    IOCON2bits.PENH = 0;        // Disable PWM2H which is on by default and higher priority than PPS
    IOCON3bits.PENL = 0;        // Disable PWM3L which is on by default and higher priority than PPS
    _CNPUB12 = 1;               // Enable Weak pull up on U2RX line (GPIO1) so we don't receive spurious data while nobody is connected
    _U2RXR   = 44;              // U2RX on RP44
    _RP45R   = _RPOUT_U2TX;     // U2TX on RP45
    EZBL_SetSYM(UART2_TX_ISR_PRIORITY, 1);  // Optionally change the U2TX Interrupt priority. The default is IPL 1 (lowest possible priority).
    EZBL_SetSYM(UART2_RX_ISR_PRIORITY, 2);  // Optionally change the U2RX Interrupt priority. The default is IPL 2 (low priority).
    if(EZBL_COMBaud <= 0)       // If auto-baud enabled, delay our UART initialization so MCP2221A POR timer and init
    {                           // is complete before we start listening. POR timer max spec is 140ms, so MCP2221A TX
        NOW_Wait(140u*NOW_ms);  // pin glitching could occur long after we have enabled our UART without this forced delay.
    }
    EZBL_COMBootIF = UART_Reset(2, FCY, EZBL_COMBaud, 1);
#endif


//    // Configure UART1 on PGED2/RP35/RB3 and PGEC2/RP36/RB4 for extra debug
//    // purposes (like printing console messages while bootloading). These pins
//    // are used as PGED2/PGEC2, so you must unplug any air-wired UART hardware
//    // while doing ICSP programming or debug.
//    //
//    // Function     dsPIC33EP64GS502 Device Pins
//    // UART1        PIC#, name
//    // U1RX  (in)     11, "PGD2" - PGED2/AN18/DACOUT1/INT0/RP35/RB3
//    // U1TX  (out)    12, "PGC2" - PGEC2/ADTRG31/EXTREF1/RP36/RB4
//    _CNPUB3 = 1;            // Enable Weak pull up on U1RX line (PGD2) so we don't receive spurious data while nobody is connected
//    _ANSB3  = 0;
//    _ANSB4  = 0;
//    _U1RXR  = 35;           // U1RX on RP35
//    _RP36R  = _RPOUT_U1TX;  // U1TX on RP36
//    EZBL_SetSYM(UART1_TX_ISR_PRIORITY, 1);          // Optionally change the U1TX Interrupt priority. The default is IPL 1 (lowest possible priority).
//    EZBL_SetSYM(UART1_RX_ISR_PRIORITY, 2);          // Optionally change the U1RX Interrupt priority. The default is IPL 2 (low priority).
//    UART_Reset(1, FCY, 230400, 1);
//    EZBL_COMBootIF = &UART1_RxFifo;       // Code needed if for setting this RX interface as the active one for bootloader activity checking


    // Configure GPIO for LCD
    // Function             dsPIC33EP64GS502 Device Pins
    // LCD1                 PIC#, name
    // LCD_RS      (out)      16, TDO/AN19/PGA2N2/RP37/RB5
    // LCD_CSB     (out)      21, TMS/PWM3H/RP43/RB11
    // LCD_MOSI    (out)       9, OSC1/CLKI/AN6/CMP3C/CMP4A/ISRC2/RP33/RB1
    // LCD_SCK     (out)       7, AN5/CMP2D/CMP3B/ISRC3/RP42/RB10
    // LCD_RST     (out)      15, PGEC3/SCL2/RP47/RB15
    _LATB15  = 0;           // LCD_RESET = 0
    _TRISB15 = 0;
    IOCON3bits.PENH = 0;    // Disable PWM3H which is on by default and higher priority than PPS
    _ANSB5   = 0;
    _ANSB1   = 0;
    _ANSB10  = 0;
    _LATB11  = 1;           // LCD_CSB = 1
    _TRISB11 = 0;
    _LATB5   = 0;           // LCD_RS = 0   // Register Select = Instruction (0)
    _TRISB5  = 0;
    _LATB15  = 1;           // LCD_RESET = 1 now
    emulatedLEDs = 0x0000;
    LCD_Init();


    // I2C1 pins used for I2C (MCP23008 attached at I2C address 0x20)
    // MCP23008 data sheet:
    // http://ww1.microchip.com/downloads/en/DeviceDoc/21919e.pdf
    //
    // Function             dsPIC33EP64GS502 Device Pins
    // I2C1                 PIC#, name
    // SCL1                   14, PGED1/TDI/AN20/SCL1/RP38/RB6
    // SDA1                   15, PGEC1/AN21/SDA1/RP39/RB7
    _CNPUB6 = 1;    // Enable weak internal pull up (board already has 2.2K resistors, but may be convenient for testing on other PCBs without pull ups)
    _CNPUB7 = 1;    // Enable weak internal pull up (board already has 2.2K resistors, but may be convenient for testing on other PCBs without pull ups)
    _ANSB6 = 0;
    _ANSB7 = 0;


    // Report 70 MIPS on dsPIC33E
    return FCY;
}


/**
 *  @function LEDToggle Toggles the state of an array of LEDs using a logical
 *                  XOR of the ledBitField provided. I.e. only set bits toggle
 *                  an LED state. Clear bits have no effect.
 *  @param ledBitField A bitmask representing an array of LEDs that should be
 *                     toggled state. Each '1' bit in the bit field toggles the
 *                     corresponding LED on or off.
 *  @return Bitmask representing the LEDs that were previously on before
 *          XORing in the ledBitField value. Bits for LEDs that do not exist are
 *          returned as '0' values in the bitmask.
 */
unsigned int LEDToggle(unsigned int ledBitField)
{
    unsigned int i;
    unsigned int ret;
    char emuLEDLine[] = "LEDs: 00000000  ";

    // Early return if we were called just to obtain the current state (for LEDSet()/LEDOn()/LEDOff())
    if(!ledBitField)
        return emulatedLEDs;

    // No LEDs on Digital Power Starter Kit that can be readily controlled, so
    // remap them to emulated LEDs on the LCD.
    ret = emulatedLEDs;

    emulatedLEDs ^= ledBitField;
    for(i = 0; i < 8u; i++)
    {
        if(emulatedLEDs & (1u<<(7-i)))
            emuLEDLine[6+i] = '1';
    }

