zachleedogg/E_Moto/Firmware/Projects/ezbl-v2.04/ex_boot_app_blink_dual_partition/hardware_initializers/dspic33ep64gs502_digital_power_starter_kit.c
    LCD_PutStr(0, 1, emuLEDLine);
    return ret;
}


/**
 * Moves the LCD cursor to the specified x and y coordinates.
 *
 * @param x 0-based column number to seek to. 0 means the left-most character,
 *          15 or 19 is typically the right-most character, depending  on if the
 *          LCD is a 16 character or 20 character wide LCD.
 *
 * @param y 0-based row or line number to seek to. 0 means the top-most
 *          character/line, 1 or 3 is typically the bottom-most visible line.
 */
void LCD_Goto(int x, int y)
{
    if(x < 0)
        x = lastX;
    if(y < 0)
        y = lastY;

    LCD_Put8(0, 0x80 |  (line_address[y] | x)); // 0x80 = Set DDRAM Address: 1 AC6 AC5 AC4 AC3 AC2 AC1 AC0 Set DDRAM address in address counter. 26.3 �s @ 2.7V
    lastX = x;
    lastY = y;
}

/**
 * Erases all characters being displayed by the LCD and resets the cursor to
 * (0,0) - top left corner.
 */
void LCD_Clear(void)
{
    LCD_Put8(0, 0x01);  // Clear Display 0000000001 Write 0x20 to DDRAM and set DDRAM address to 0x00 1.08ms
}


/**
 * Writes a null terminated string to the character LCD
 *
 * @param s Null-terminated string to print
 */

void LCD_PutStr(int x, int y, const char *s)
{
    LCD_Goto(x, y);
    while(*s)
    {
        LCD_Put8(1, *s++);
    }
}

/**
 * Writes a set of bytes to the LCD for display.
 *
 * @param x Column or horizontal coordinate to start printing at, where 0 is the
 *          left-most visible character on a line.
 *
 *          Specify -1 for the current x position.
 *
 * @param y Row or line coordinate to start printing at, where 0 is the top-most
 *          visible line.
 *
 *          Specify -1 for the current y position.
 *
 * @param s Pointer to character array to write to the LCD
 *
 * @param dataLen Number of characters of data to write to the LCD
 */

void LCD_Put(int x, int y, const char *data, unsigned int dataLen)
{
    LCD_Goto(x, y);
    while(dataLen--)
    {
        LCD_Put8(1, *data++);
    }
}


/**
 * Initializes the (NHD-C0216CZ-FSW-FBW-3V3) 16x2 character LCD with a clear
 * display and visible cursor at 0,0 position.
 *
 * I/O pins and SPI peripheral are initialized.
 */
void LCD_Init(void)
{
    LCD_RST        = 0;
    LCD_CS         = 1;
    LCD_RST_TRIS   = 0; // LCD_RST = LCD Reset "RST", active low
    LCD_CS_TRIS    = 0; // LCD_CS = LCD Chip Select "CSB", active low
    LCD_RS_TRIS    = 0; // LCD_RS = LCD Register Select; 0 = Instruction, 1 = Data

    LCD_MOSI_TRIS  = 0; // LCD_MOSI = LCD Serial Data Input "SI"
    LCD_SCK_TRIS   = 0; // LCD_SCK  = LCD Serial Data Input Clock "SCL" - SPI-like, but idle state == 1

    LCD_RST        = 0; // Assert LCD active low RST reset signal
    NOW_Wait(25u*NOW_ms);
    LCD_RST        = 1; // end reset
    busyInterval   = 0; // No initial delay time

    LCD_Put8(0, 0x30);  // Wake Up - Function Set = 8-bits | Instruction Table 0
    busyInterval = 2u*NOW_ms;
    LCD_Put8(0, 0x30);  // Wake Up - Function Set = 8-bits | Instruction Table 0
    LCD_Put8(0, 0x30);  // Wake Up - Function Set = 8-bits | Instruction Table 0

    LCD_Put8(0, 0x39);  // Instruction Table 0: Function Set = 8-bits | 2-line | Instruction Table 1 select
    LCD_Put8(0, 0x14);  // Instruction Table 1: Internal OSC Frequency = 1/4 bias | F0 OSC adjust
    LCD_Put8(0, 0x56);  // Instruction Table 1: Power/ICON Control = ICON display off | Set boost circuit on | Internal contrast follower mode = 0x2
    LCD_Put8(0, 0x6D);  // Instruction Table 1: Follower Control = Follower circuit on | Follower amplifier ratio = 0x5
    LCD_Put8(0, 0x70);  // Instruction Table 1: Contrast Set = Contrast = 0x0
    LCD_Put8(0, 0x0C);  // Instruction Table 0: Display ON/OFF = Entire display on, Cursor off, Cursor Blink off
    LCD_Put8(0, 0x06);  // Instruction Table 0: Entry Mode Set = Post-write move cursor right, do not shift display
    LCD_Put8(0, 0x01);  // Instruction Table 0: Clear Display (and set cursor home at 0,0 position)
}


/**
 * Writes one byte of data to the LCD Display RAM or the LCD Instruction
 * handler.
 *
 * If a prior command or data was executed recently, this function blocks until
 * the prior command/data is finished executing/writing. Upon return, a software
 * timer is captured to correctly discern in the future how long a delay may be
 * needed to complete this command, if not finished by the subsequent call.
 *
 * This function internally handles Chip Select assertion/deassertion with chip
 * select always being deasserted upon return.
 *
 * @param data_instr Write target: 0 = LCD Instruction handler; 1 = Display RAM
 *
 * @param c Byte of data to write to the LCD.
 */
void LCD_Put8(int data_instr, char c)
{
    unsigned int i;

    LCD_SCK       = 1;               // Idle state is high
    LCD_SCK_TRIS  = 0;
    while((unsigned long)(NOW_32() - lastLCDUpdate) < busyInterval); // Wait for last transaction to complete with necessary hold time, if any
    LCD_CS        = 0;               // Assert chip select - 20ns set up time to clock rising edge, 350ns hold time @ 2.7V
    LCD_CS_TRIS   = 0;
    LCD_RS        = data_instr;      // Select RS = Instruction target (0) or Data RAM (0) - 10ns set up time to clock rising edge, 250ns hold time @ 2.7V
    LCD_RS_TRIS   = 0;
    LCD_MOSI_TRIS = 0;


    for(i = 0; i < 8u; i++)
    {
        LCD_SCK  = 0;       // Clock low
        LCD_MOSI = 0;       // Generate output data - MSbit first
        if(c & 0x80)
            LCD_MOSI = 1;
        c <<= 1;
        __delay32(32);      // Clock low for at least 160ns @ 2.7V. 32-CPU clocks will be good for at least up to 200MHz
        LCD_SCK  = 1;       // Clock high - 20ns min with 200ns min clock period
        __delay32(8);       // Clock low for at least 160ns @ 2.7V. 8-CPU clocks will be good for at least up to 200MHz
    }

    lastLCDUpdate = NOW_32();
    busyInterval = 32u*NOW_us;  // 26.3us execution time by default assumed
    if(!data_instr)         // Do special things for certain instructions
    {
        if((c & 0x03) == c) // Clear Display (0x01) or Return Home (0x02 or 0x03) take 1.08ms @ slowest clock; everything else 26.3us
        {
            busyInterval = 2u*NOW_ms;
            lastX = 0;
            lastY = 0;
        }
    }
    else
    {   // Special things for data
        lastX++;
    }

    __delay32(32);
    LCD_CS = 1;                                     // Deselect LCD; 350ns hold time, which above code surely meets
}



/**
 * Writes the specified data to the LCD using a printf()-style variable argument
 * list. All existing characters on the LCD not specifically set with new
 * data are erased to whitespace.
 *
 * Internally calls vsprintf(), so see printf() compiler documentation for exact
 * formatting parameters.
 *
 * Buffer space is allocated for a 2 line x 16 character LCD, so ensure the
 * specified parameters to print do not exceed 32 characters. Excess characters
 * will cause stack overflow and undefined behavior.
 *
 * This is a blocking function that returns upon write completion.
 *
 * An example calling sequence to get a known number of characters per line is:
 *      LCD_printf("Buck %01.2fV %01.2fW"
 *                 "Bst % 2.2fV %01.2fW", buckVoltage, buckLoadPower, boostVoltage, boostLoadPower);
 * where buckVoltage, buckLoadPower, boostVoltage, and boostLoadPower are all of
 * type double. "01.2" " 2.2" specify digits to display to the left and
 * right of the radix point, with '0' or ' ' (space) characters to display as
 * padding if the value is < 1.00. Two back-to-back string literals in C are
 * automatically concatenated into one string (note that there is no comma
 * separating them).
 */
void LCD_printf(int x, int y, const char *format, ...)
{
    extern int EZBL_vsprintf(char *outputBuf, const char *format, void *args);  // Prototype so we don't have to include ezbl.h. NOTE: to use this function and not get a link error for the EZBL_vsprintf symbol, you must have ezbl_lib.a included in your project tree under Libraries.

