zachleedogg/E_Moto/Firmware/Projects/ezbl-v2.04/ex_boot_app_blink_dual_partition/hardware_initializers/dspic33ep64gs502_digital_power_starter_kit.c
    va_list args;
    unsigned int bufSize;
    char *c;
    unsigned int escapeLevel;

    bufSize = xLimit*yLimit + 32u;          // Extra 32 bytes for null termination, non-printing formatting chars like '\r' or '\n' and in case if sprintf() overflows. sprintf() does not support a max output length parameter.
    c = (char*)__builtin_alloca(bufSize);   // Allocate temporary buffer on the stack

    va_start(args, format); // Initialize variable arguments list
    EZBL_vsprintf(c, format, args);
    va_end(args);           // Clean up variable arguments list (does nothing in GNU C)

    escapeLevel = 0;
    LCD_Goto(x, y);         // Start at the specified position
    while(1)
    {
        if(*c == 0x00)      // Null terminator
            return;

        if(escapeLevel == 0u)
        {
            switch(*c)
            {
                case '\r':                  // Erase all other characters on this line until we reach the end, then reposition cursor to beginning of this same line
                    while(x++ < xLimit)
                        LCD_Put8(1, ' ');
                    x = 0;
                    LCD_Goto(x, y);
                    break;

                case '\n':                  // Don't erase any characters, just move down one line and seek to x = 0
                    if(++y >= yLimit)
                        return;
                    x = 0;
                    LCD_Goto(x, y);
                    break;

                case '\t':
                    if(x >= xLimit)
                    {
                        x = 0;
                        if(++y >= yLimit)
                            return;
                        LCD_Goto(x, y);
                        break;
                    }
                    while(x++ < xLimit)
                    {
                        LCD_Put8(1, ' ');       // Write spaces until we reach the next multiple of 4 boundary
                        if((x & 0x3u) == 0x0u)
                            break;
                    }
                    break;

                case '\f':  // Form Feed (0x0C). This will explicitly clear the screen and put the cursor at position (0,0).
                    LCD_Put8(0, 0x01);   // Clear Display 0000000001 Write 0x20 to DDRAM and set DDRAM address to 0x00 1.08ms                    x = 0;
                    x = 0;
                    y = 0;
                    break;

                case 0x1B:  // ^[ (CTRL+[) escape character key. Use '\x1B' in a string to invoke this. Ex: "\x1BC\x1BC\x1BC\x1BC0x%04X" will keep 4 characters unchanged on the LCD, followed by the printing of an uppercase hexadecimal integer padded to 4 digits.
                    escapeLevel = 1;
                    break;

                default:
                    if(x++ >= xLimit)
                    {
                        x = 0;
                        if(++y >= yLimit)
                            return;
                        LCD_Goto(x, y);
                    }
                    LCD_Put8(1, *c);
                    break;
            }
        }
        else if(escapeLevel == 1u)
        {
            switch(*c)
            {
                case 'A':   // Up - move up a line, maintaining x position and saturating at y = 0
                    if(y > 0u)
                        y--;
                    break;

                case 'B':   // Down - same as \n, but saturates just after the last line without returning
                    if(y < yLimit)
                        y++;
                    break;

                case 'C':   // Right - move right a character without affecting old contents, saturating at the end of the line
                    if(x < xLimit)
                        ++x, y;
                    break;

                case 'D':   // Left - move left a character without affecting old contents, saturating at x = 0
                    if(x > 0u)
                        x--;
                    break;

                case 'F':   // End (of the current line - actually the last character in the printable line)
                    x = xLimit;
                    break;

                case 'H':   // Home (of the current line)
                    x = 0;
                    break;

                default:    // Unsupported - just eat this character
                    break;
            }
            LCD_Goto(x, y);
            escapeLevel = 0;
        }

        if(--bufSize == 0u)
            return;
        c++;
    }
}

//----------------------------------------------------------------------------


#endif //#if defined(__dsPIC33EP64GS506__) || defined(__dsPIC33EP64GS504__)  || defined(__dsPIC33EP64GS502__) || defined(__dsPIC33EP32GS506__) || defined(__dsPIC33EP32GS504__)  || defined(__dsPIC33EP32GS502__) || defined(__dsPIC33EP16GS506__) || defined(__dsPIC33EP16GS504__)  || defined(__dsPIC33EP16GS502__)

